/*
Створити дві змінні, А і B.
Покласти в А десятку.
Покласти в B сотню.
Потім написати команди, які в підсумку приведуть до того, що значення в цих двох змінних поміняються.

Звичайно, можна просто закинути сотню в А, а десятку в В, але це буде не круто.
Треба написати такі хитрі команди, щоб було неважливо - що було до цього покладено в А і В.

В кінці вивести на екран вміст А і В, щоб побачити на власні очі, що дійсно відбувся обмін.

Рівні складності:


    використати дві додаткові змінні

    використати одну додаткову змінну як проміжний контейнер при обміні

    не використовувати додаткові змінні (це складно :) )


 */

let a = 10;
let b = 100;
console.log(a, b);

/*let arr = [a, b];
a = arr[1];
b = arr[0];*/

/*let c = { "a": a, "b": b}
a = c["b"];
b = c["a"];*/

[a, b] = [b, a];
console.log(a, b);