/*
питати людину про числа (вважатимемо, що він буде вводити тільки непарні числа, і їх буде не більше 20)
 до тих пір, доки він не введе 0, і потім вивести на екран відцентровану штуку

1
5
1
3
0
  *
*****
  *
 ***

 */

let arr1 = [];
let num = +prompt("Введіть не парне число до 20. Для зупинки введення введіть 0: ");
while(num > 0 || num % 2 != 0 || num > 20) {
		arr1.push(num);
    num = +prompt("Введіть не парне число до 20. Для зупинки введення введіть 0: ");
}
let figure = '';
let a = 0;
for (let i = 0; i < arr1.length; i++){
    a = (Math.max(...arr1) - arr1[i]) / 2;
    while (a > 0) {
        figure += " ";
        a--;
    }
    let b = arr1[i];
    while (b > 0) {
        figure += "*";
        b--;
    }
    figure += "\n";



}
console.log(figure);
