/*
Задача про ліфт.

написати програму, яка імітує ліфт:


    Питає номер поверху,

    Якщо менше 1 чи більше 9, то виводить "невірний поверх".

    Якщо 1-3 чи 7-9 то пише "ок".

    Якщо ж від 4 до 6, то просить ввести пароль (числовий).

        Якщо пароль не дорівнює 1337, то програма каже "невірний пароль", а інакше "ок".


*/

let stage = +prompt("На який Вам поверх?");
if (stage > 9 || stage < 1) {
    console.log("Невірний поверх!")
} else if (stage > 3 && stage < 7) {
    let password = +prompt("Введіть пароль: ");
    if (password === 1337) {
        console.log("Пароль вірний. Поїхали!!!")
    } else {
        console.log("Пароль невірний.")
    }
} else {
    console.log("Поїхали!!!");
}